{
  "title": "Venturers are Ready For NEW Adventures!\n Look Wide!",
  "description": "Venturer Scouts are young people aged between 14 and 18 years old, dedicated to fun, adventure and serving the community. Venturers Scouts transition to the Rover Scout Unit after turning 18 whilst Venturer Scouts who turn 18 during Year 12 can wait to transition until they complete Year 12.\n\nVenturers are:",
  "points":["Discovering and exploring independence","Broadening their perspectives","Securing their interests and priorities in life","Relying strongly on peer support","Taking on more responsibilities","Seeking purpose, challenge and risk"],
  "footer":"When you’re dealing with your toughest years in school and making decisions about your future, Venturer Scouts offer vital breathing space. You can focus on friendship and personal growth, while picking up valuable life skills along the way.\n\nVenturer Scouts enjoy interstate, national and even international travel experiences. We take time out to work on mental and physical well-being. You can learn to fly, abseil down cliffs or climb mountains.\n\nCamping steps up to a whole new level of adventure, with snow challenges, rafting, horse riding and scuba diving. It’s all about healthy risk-taking, when so many young friends are making unhealthy choices.\n\nAs a Venturer Scout, you can contribute to the Scouting movement through the Venturer Scout Youth Council. Your voice really counts.\n\nWe also provide a supportive environment for you to develop your ideals. You can discuss moral and social issues, which might include religion and spirituality or gender and relationships. Scouts, Venturer Scouts, Rover Scouts and Leaders walk together in Melbourne’s annual Pride March.\n\nYour achievement really steps up in Venturer Scouts and can earn vocational qualifications, recognised across Australia or you can use your Scouting experiences towards your VCE.\n\nThe Queen’s Scout Award, the Peak award for Venturer Scouts, is so highly respected that several universities will recognise it for entry purposes.\n\nIn 2020/21 all Scout sections are now actively engaged in 'Our Program' and moving to common Achievement Pathways One Program- One Journey.\n\nYou don’t need to have any previous Scouting experience. We’ll help you catch up."
}
